##  pandas数据删除

### 数据的删除
#### drop

In [1]:
import numpy  as np
import pandas as pd
from faker import Faker

fake = Faker('zh_CN')
df=pd.DataFrame(data=[ [fake.name()] for x in range(10) ],columns=['name'])

In [2]:
df['销售额']=np.random.randint(100,100000,size=(10, 1))

In [3]:
df.insert(0,'dept',['部门1']*5+['部门2']*5)

In [11]:
df # 随机生成的数据

     销售额
0  97695
1  57198
2  31264
3   9904
4  61159
5  19804
6  79772
7  21118
8  12487
9   5515

In [8]:
df.drop(['dept','name'],axis=1,inplace=True) # 删除两列 。这个是在副本上删除列，注意这点.
# inplace=True，则是真正删除。也可以 删除后 将副本赋值给df来实现同样效果

In [10]:
df.drop(0,axis=0) # 删除第一行（行号为0）。注意，也是删除副本的第一行，可使用inplace=True真正删除

     销售额
1  57198
2  31264
3   9904
4  61159
5  19804
6  79772
7  21118
8  12487
9   5515

In [12]:
df.drop([0,1],axis=0) # 删除制定的行

     销售额
2  31264
3   9904
4  61159
5  19804
6  79772
7  21118
8  12487
9   5515